public/cosine_similarity.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cosine Similarity</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
					 <link rel="stylesheet" href="style.css" />

</head>
<body>
<div id="preamble" class="status">
<header><nav><a href="/">Home</a>
<a href="https://www.linkedin.com/in/igoracmelo/">LinkedIn</a>
<a href="https://github.com/igorcafe">GitHub</a></nav></header>
</div>
<div id="content" class="content">
<h1 class="title">Cosine Similarity</h1>
<p>
Cosine similarity is one way to measure the similarity between two vectors.
It's defined as the cosine of the angle formed by the vectors.
</p>

<p>
This means vectors with small angle difference will have a cosine closer to 1.0
("100%"), while vectors with large angle difference will have a cosine closer to
0.0 ("0%").
</p>

<p>
Note: cosine similary just takes into account the angle, not the magnitude of
the vector, so it may not be suitable for every comparison.
</p>

<p>
Here is how you can compute the cosine similarity of two vectors \(\vec{A}\) and \(\vec{B}\):
</p>

\begin{equation}
\text{Cosine Similarity} =
\frac{{\vec {A}} \cdot {\vec {B}}}
     {\|{\vec {A}}\|_{2}\|{\vec {B}}\|_{2}}
\end{equation}

<p>
Cosine similarity is commonly used for comparing text similarity.
The idea is to take the sentences that you want to compare and convert each into
a vector representing its meaning in a process called embedding.
</p>

<p>
The cool thing about cosine similarity is that it works regardless of how many
dimensions your vector has.
GPT 4o embeddings, for example, consist of vectors with 1536 dimensions.
</p>
</div>
</body>
</html>
